### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [44]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [45]:
#TOTAL PLAYERS
total_players_df = pd.DataFrame(purchase_df["SN"].unique())
total_players_df.columns = {"Unique Players"}
total_players_df
totalPlayers = len(total_players_df)
totalPlayers

576

In [46]:


total_players = pd.DataFrame(total_players_df.count())
total_players.columns = {"Total Players"}
total_players.index = np.arange(0, len(total_players))
total_players

   Total Players
0            576

In [47]:
uniqueItemsTemp = pd.DataFrame(purchase_df["Item Name"].unique())
uniqueItemsTemp
uniqueItemsTemp.columns = {"Unique Items"}
uniqueItemsTemp

                                  Unique Items
0    Extraction, Quickblade Of Trembling Hands
1                            Frenzied Scimitar
2                                 Final Critic
3                                  Blindscythe
4                                         Fury
..                                         ...
174                Alpha, Reach of Ending Hope
175                                      Alpha
176                                   Betrayer
177   Winterthorn, Defender of Shifting Worlds
178                         Gladiator's Glaive

[179 rows x 1 columns]

## Purchasing Analysis (Total)

In [48]:
summary_df = pd.DataFrame()
summary_df["Number of Unique Items"] = uniqueItemsTemp.count()
summary_df.index = np.arange(len(summary_df))
summary_df

   Number of Unique Items
0                     179

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [49]:
#MEAN PRICE
meanPrice = purchase_df["Price"].mean()
print("Mean Price")

summary_df["Average Price"] = meanPrice

Mean Price

In [50]:
#Count of purchases, do not think this is accurate
countOfPurchases = purchase_df["Purchase ID"].count()
print("Count of Purchases")
summary_df["Number of Purchases"] = countOfPurchases

Count of Purchases

In [51]:
#Total Revenue
revenue = purchase_df["Price"].sum()
print("Revenue")
summary_df["Total Revenue"] = revenue
summary_df["Total Revenue"] = summary_df["Total Revenue"].astype(float)

Revenue

In [52]:
#CREATE AND PRINT DATA FRAME HERE
summary_df["Average Price"] = summary_df["Average Price"].map("${:.2f}".format)



summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:.2f}".format)


summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [53]:
#Percentage and Count of Male Players
gender_df = pd.DataFrame(purchase_df[["SN", "Gender"]])
#not sure how to get the count of those values
gender_df

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [54]:
gender_uniques_df = gender_df.drop_duplicates()
gender_uniques_df

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [55]:
display_uniques_df = pd.DataFrame(gender_uniques_df["Gender"].value_counts())

display_uniques_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [56]:
display_uniques_df["Percent of Players"] = (display_uniques_df["Gender"] / totalPlayers) * 100
display_uniques_df["Percent of Players"] = display_uniques_df["Percent of Players"].map("{:,.2f}%".format)

display_uniques_df

                       Gender Percent of Players
Male                      484             84.03%
Female                     81             14.06%
Other / Non-Disclosed      11              1.91%

In [57]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [58]:
new_df = pd.DataFrame(purchase_df[["SN", "Gender", "Price"]])
new_df

                SN  Gender  Price
0          Lisim78    Male   3.53
1      Lisovynya38    Male   1.56
2       Ithergue48    Male   4.88
3    Chamassasya86    Male   3.27
4        Iskosia90    Male   1.44
..             ...     ...    ...
775     Aethedru70  Female   3.54
776         Iral74    Male   1.63
777     Yathecal72    Male   3.46
778        Sisur91    Male   4.19
779      Ennrian78    Male   4.60

[780 rows x 3 columns]

In [59]:
counts= pd.DataFrame(purchase_df["Gender"].value_counts())
counts
counts = counts.rename(columns = {"Gender" : "Purchase Count"})
counts

                       Purchase Count
Male                              652
Female                            113
Other / Non-Disclosed              15

In [60]:
#male gender table
columns = {"SN", "Gender", "Price"}

malePurchasePrice = new_df.loc[new_df["Gender"] == "Male", columns]

malePurchasePrice

                SN Gender  Price
0          Lisim78   Male   3.53
1      Lisovynya38   Male   1.56
2       Ithergue48   Male   4.88
3    Chamassasya86   Male   3.27
4        Iskosia90   Male   1.44
..             ...    ...    ...
774     Jiskjask80   Male   4.19
776         Iral74   Male   1.63
777     Yathecal72   Male   3.46
778        Sisur91   Male   4.19
779      Ennrian78   Male   4.60

[652 rows x 3 columns]

In [61]:
avgMalePrice = malePurchasePrice["Price"].mean()
round(avgMalePrice, 2)

3.02

In [62]:
#female gender table
columns = {"SN", "Gender", "Price"}

femalePurchasePrice = new_df.loc[new_df["Gender"] == "Female", columns]

femalePurchasePrice

                  SN  Gender  Price
15         Lisassa64  Female   2.89
18         Reunasu60  Female   4.90
38          Reulae52  Female   4.18
41         Assosia88  Female   1.33
55         Phaelap26  Female   3.79
..               ...     ...    ...
731         Eudanu84  Female   1.02
740        Reunasu60  Female   3.92
754  Pheosurllorin41  Female   4.05
767          Ilmol66  Female   4.88
775       Aethedru70  Female   3.54

[113 rows x 3 columns]

In [63]:
avgFemalePrice = femalePurchasePrice["Price"].mean()
round(avgFemalePrice, 2)

3.2

In [64]:
#other gender table
columns = {"SN", "Gender", "Price"}

otherPurchasePrice = new_df.loc[new_df["Gender"] == "Other / Non-Disclosed", columns]

otherPurchasePrice

               SN                 Gender  Price
9     Chanosian48  Other / Non-Disclosed   3.58
22   Siarithria38  Other / Non-Disclosed   3.81
82     Haerithp41  Other / Non-Disclosed   4.40
111      Sundim98  Other / Non-Disclosed   4.75
228   Jiskirran77  Other / Non-Disclosed   3.39
237     Idairin51  Other / Non-Disclosed   3.55
242     Eodaisu60  Other / Non-Disclosed   3.94
291     Idairin51  Other / Non-Disclosed   3.45
350     Rairith81  Other / Non-Disclosed   2.22
401      Lirtim36  Other / Non-Disclosed   1.33
484   Chanosian48  Other / Non-Disclosed   3.94
549    Maluncil97  Other / Non-Disclosed   3.10
629    Maluncil97  Other / Non-Disclosed   2.18
637        Airi27  Other / Non-Disclosed   3.45
747  Siarithria38  Other / Non-Disclosed   3.10

In [65]:
avgOtherPrice = otherPurchasePrice["Price"].mean()
round(avgOtherPrice, 2)

3.35

In [66]:
#sums
sumOfMale = malePurchasePrice["Price"].sum()
sumOfMale

1967.64

In [67]:
sumOfFemale = femalePurchasePrice["Price"].sum()
sumOfFemale

361.94

In [68]:
sumOfOther = otherPurchasePrice["Price"].sum()
sumOfOther

50.19

In [69]:
male_summed_df = malePurchasePrice.groupby(["SN", "Gender"])["Price"].sum()
male_total_mean = male_summed_df.mean()

In [70]:
female_summed_df = femalePurchasePrice.groupby(["SN", "Gender"])["Price"].sum()
female_total_mean = female_summed_df.mean()
female_total_mean

4.468395061728394

In [71]:
other_summed_df = otherPurchasePrice.groupby(["SN", "Gender"])["Price"].sum()
other_total_mean = other_summed_df.mean()
other_total_mean

4.5627272727272725

In [72]:
#creating Purchasing analysis table
counts["Average Purchase Price"] = [avgMalePrice, avgFemalePrice, avgOtherPrice]
counts["Total Purchase Value"] = [sumOfMale, sumOfFemale, sumOfOther]
counts["Avg Total Purchase per Person"] = [male_total_mean, female_total_mean, other_total_mean]

counts

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Male,652,3.017853,1967.64,4.065372
Female,113,3.203009,361.94,4.468395
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [73]:
#formatting
counts["Average Purchase Price"] = counts["Average Purchase Price"].map("${:.2f}".format)
counts["Total Purchase Value"] = counts["Total Purchase Value"].map("${:.2f}".format)
counts["Avg Total Purchase per Person"] = counts["Avg Total Purchase per Person"].map("${:.2f}".format)


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [74]:
#Person Analysis Gender DF
counts

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Male,652,$3.02,$1967.64,$4.07
Female,113,$3.20,$361.94,$4.47
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [75]:
purchase_df2 = purchase_df.copy()
purchase_df3 = purchase_df2[["SN", "Age"]]
testing_df = purchase_df3.drop_duplicates()
testing_df
#AGE BINS
bins = [0, 9, 14, 19, 24, 29, 34, 39, 200]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

testing_df["Age Bin"] = pd.cut(testing_df["Age"], bins, labels = group_names)
testing_df

testing_df = testing_df.groupby("Age Bin")
testing_df.count()

age_sum_df = pd.DataFrame(testing_df.count())
age_sum_df
age_sum_df["SN"] = (age_sum_df["SN"] / totalPlayers) * 100
age_sum_df

#format
formatTable = age_sum_df[["Age", "SN"]]
formatTable

fixFormat = formatTable.rename(columns = {"Age" : "Total Count", "SN" : "Percent of Players"})
fixFormat

fixFormat["Percent of Players"] = fixFormat["Percent of Players"].map("{:,.2f}%".format)
fixFormat

<ipython-input-75-5029c77a2ae4>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  testing_df["Age Bin"] = pd.cut(testing_df["Age"], bins, labels = group_names)

         Total Count Percent of Players
Age Bin
<10               17              2.95%
10-14             22              3.82%
15-19            107             18.58%
20-24            258             44.79%
25-29             77             13.37%
30-34             52              9.03%
35-39             31              5.38%
40+               12              2.08%

In [76]:
price_testing = purchase_df.copy()
groupby_df4 = price_testing.groupby("SN")
df = pd.DataFrame(groupby_df4[["SN", "Price"]].sum())

#price_testing - I was able to find the unique values for their purchases for 
#the Avg Total Purchase per Person, but I was unable to figure out how to put 
#it into the final df with the bins
df

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [77]:

bins = [0, 9, 14, 19, 24, 29, 34, 39, 200]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

price_testing["Age Bin"] = pd.cut(price_testing["Age"], bins, labels = group_names)
price_testing
price_testing = price_testing.groupby("Age Bin")
price_testing.count()

price_sum_df = pd.DataFrame(price_testing.count())
price_sum_df

formatPriceTable = price_sum_df[["Age"]]
formatPriceTable

formatPriceTable["Average Purchase Price"] = price_testing["Price"].mean()
formatPriceTable["Total Purchase Value"] = price_testing["Price"].sum()
#formatPriceTable["Avg Total Purchase per Person"] = price_testing["Price"]

#formatting
formatPriceTable["Total Purchase Value"] = formatPriceTable["Total Purchase Value"].map("${:,.2f}".format)
formatPriceTable["Average Purchase Price"] = formatPriceTable["Average Purchase Price"].map("${:,.2f}".format)

<ipython-input-77-bcb897e08a15>:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  formatPriceTable["Average Purchase Price"] = price_testing["Price"].mean()
<ipython-input-77-bcb897e08a15>:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  formatPriceTable["Total Purchase Value"] = price_testing["Price"].sum()
<ipython-input-77-bcb897e08a15>:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  formatPriceTable["Total Purchase Value"] = formatPriceTable["Total Purchase Value"].map("${:,.2f}".format)
<ipython-input-77-bcb897e08a15>:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  formatPriceTable["Average Purchase Price"] = formatPriceTable["Average Purchase Price"].map("${:,.2f}".format)

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [78]:
formatPriceTable

         Age Average Purchase Price Total Purchase Value
Age Bin
<10       23                  $3.35               $77.13
10-14     28                  $2.96               $82.78
15-19    136                  $3.04              $412.89
20-24    365                  $3.05            $1,114.06
25-29    101                  $2.90              $293.00
30-34     73                  $2.93              $214.00
35-39     41                  $3.60              $147.67
40+       13                  $2.94               $38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [79]:
top_spenders = purchase_df[["SN", "Purchase ID", "Price"]]
top_spenders

top_spenders2 = pd.DataFrame(top_spenders.groupby(["SN"])["Price"].sum())
top_spenders2

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [80]:
avg_top = pd.DataFrame(top_spenders.groupby(["SN"])["Price"].mean())

top_spenders2["Avg Purchase Price"] = avg_top
top_spenders2

top_spenders2["Purchase Count"] = top_spenders.groupby(["SN"])["Price"].count()

sorted_spender = top_spenders2.sort_values(["Price"], ascending=[False])
sorted_spender = sorted_spender.rename(columns = {"Price" : "Total Purchase Value"})

sorted_spender["Total Purchase Value"] = sorted_spender["Total Purchase Value"].map("${:,.2f}".format)
sorted_spender["Avg Purchase Price"] = sorted_spender["Avg Purchase Price"].map("${:,.2f}".format)

sorted_spender

            Total Purchase Value Avg Purchase Price  Purchase Count
SN
Lisosia93                 $18.96              $3.79               5
Idastidru52               $15.45              $3.86               4
Chamjask73                $13.83              $4.61               3
Iral74                    $13.62              $3.40               4
Iskadarya95               $13.10              $4.37               3
...                          ...                ...             ...
Ililsasya43                $1.02              $1.02               1
Irilis75                   $1.02              $1.02               1
Aidai61                    $1.01              $1.01               1
Chanirra79                 $1.01              $1.01               1
Alo38                      $1.00              $1.00               1

[576 rows x 3 columns]

In [81]:
sorted_spender

            Total Purchase Value Avg Purchase Price  Purchase Count
SN
Lisosia93                 $18.96              $3.79               5
Idastidru52               $15.45              $3.86               4
Chamjask73                $13.83              $4.61               3
Iral74                    $13.62              $3.40               4
Iskadarya95               $13.10              $4.37               3
...                          ...                ...             ...
Ililsasya43                $1.02              $1.02               1
Irilis75                   $1.02              $1.02               1
Aidai61                    $1.01              $1.01               1
Chanirra79                 $1.01              $1.01               1
Alo38                      $1.00              $1.00               1

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [82]:
item_purchase_df = purchase_df[["Item ID", "Item Name", "Price"]]
item_purchase_df

no_dupe_item = item_purchase_df.drop_duplicates()

no_dupe_item

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
673      130                                      Alpha   2.07
700       90                                   Betrayer   2.94
717      177   Winterthorn, Defender of Shifting Worlds   2.08
727      104                         Gladiator's Glaive   1.93
751       30                                Stormcaller   3.36

[183 rows x 3 columns]

In [83]:
purchaseCount = pd.DataFrame(purchase_df.groupby(["Item ID"])["Purchase ID"].count())
purchaseCount

         Purchase ID
Item ID
0                  4
1                  4
2                  6
3                  6
4                  5
...              ...
178               12
179                6
181                5
182                3
183                3

[179 rows x 1 columns]

In [84]:
purchaseCount2 = pd.DataFrame(item_purchase_df.groupby(["Item ID"])["Price"].sum())
purchaseCount2

         Price
Item ID
0         5.12
1        11.77
2        14.88
3        14.94
4         8.50
...        ...
178      50.76
179      26.88
181       8.30
182      12.09
183       3.27

[179 rows x 1 columns]

In [85]:
purchaseCount2["Purchase Count"] = purchaseCount
purchaseCount2

merged_df = pd.merge(no_dupe_item, purchaseCount2, on = "Item ID")

sorted_spender = sorted_spender.rename(columns = {"Price" : "Total Purchase Value"})
merged_df = merged_df.rename(columns = {"Price_x" : "Item Price", "Price_y" : "Total Purchase Price"})

merged_df["Item Price"] = merged_df["Item Price"].map("${:,.2f}".format)
merged_df["Total Purchase Price"] = merged_df["Total Purchase Price"].map("${:,.2f}".format)

merged_df = merged_df.sort_values(["Purchase Count"], ascending=[False])

merged_df

,Item ID,Item Name,Item Price,Total Purchase Price,Purchase Count
2,92,Final Critic,$4.88,$59.99,13
3,92,Final Critic,$4.19,$59.99,13
26,178,"Oathbreaker, Last Hope of the Breaking Storm",$4.23,$50.76,12
0,108,"Extraction, Quickblade Of Trembling Hands",$3.53,$31.77,9
18,82,Nirvana,$4.90,$44.10,9
...,...,...,...,...,...
157,118,"Ghost Reaver, Longsword of Magic",$2.17,$2.17,1
156,91,Celeste,$4.17,$4.17,1
76,134,Undead Crusader,$4.50,$4.50,1
117,51,Endbringer,$4.66,$4.66,1
182,104,Gladiator's Glaive,$1.93,$1.93,1

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [86]:
mostProfitable = merged_df.sort_values(["Total Purchase Price"], ascending =[False])

mostProfitable

,Item ID,Item Name,Item Price,Total Purchase Price,Purchase Count
122,63,Stormfury Mace,$4.99,$9.98,2
62,29,"Chaos, Ender of the End",$1.98,$9.90,5
145,173,Stormfury Longsword,$4.93,$9.86,2
155,38,"The Void, Vengeance of Dark Magic",$2.37,$9.48,4
1,143,Frenzied Scimitar,$1.56,$9.36,6
...,...,...,...,...,...
154,106,Crying Steel Sickle,$3.41,$10.23,3
23,151,Severance,$3.40,$10.20,3
47,110,Suspension,$1.44,$10.08,7
182,104,Gladiator's Glaive,$1.93,$1.93,1
136,42,The Decapitator,$1.75,$1.75,1